<!--  -->
<template>
<div class='content'>
  <div class="article">
    <div class="article-top">
      <h1>愿你编码半生，归来仍是少年</h1>
      <div class="article-info">
        <span><i class="fa fa-clock-o" aria-hidden="true"></i><i> 2020-07-08</i></span>
        <span><i class="fa fa-user" aria-hidden="true"></i><i> 萌萌哒的酷狗君</i></span>
        <span><i class="fa fa-folder-open-o" aria-hidden="true"></i><i> JavaScript</i></span>
      </div>
      <div class="article-say">愿自己永远年轻，永远保持热泪盈眶，永远在路上 <span>--- Mr.Wan</span></div>
    </div>
    <div class="article-content">
      <p>《定风波·南海归赠王定国侍人寓娘》<br>宋代：苏轼</p>
      <p>常羡人间琢玉郎，天应乞与点酥娘。<br>尽道清歌传皓齿，风起，雪飞炎海变清凉。<br>万里归来颜愈少，微笑，笑时犹带岭梅香。<br>试问岭南应不好，却道：此心安处是吾乡。</p>
      <p>标题出自此诗中的《万里归来颜愈少》</p>
      <p>时间过得真的如梭一般，转眼间就已经成为别人口中快要毕业的学长。那么这篇文章就献给即将毕业的自己，用来记录我那恍恍惚惚的四年以及自己的求职之路吧。如果你我是朋友，那么看看关于我的大学生活后可以说说你的看法；如果恰好你也是一名懵懂的程序猿，希望我的经历对你能有些许帮助吧。</p>
      <h2 id="h2-u5BFBu627Eu4E00u4E2Au5F00u59CB"><a name="寻找一个开始" class="reference-link"></a><span class="header-link octicon octicon-link"></span>寻找一个开始</h2><p>高中之前的我对于大学基本没有什么印象，唯一有的就是高中课堂上，老师们常言的熬过了高中，大学就是轻松的。这句gui话对当时的我们来说确实有许多的激励。大学真的是轻松的吗？</p>
      <p><strong>没错，大学确实可以是轻松的。</strong></p>
      <p>高中我还算是那种挺努力的人，有过坚持早起去教室刷阅读理解的疲惫，也有过傍晚教学楼熄灯才收拾准备回寝室的心酸，但是却始终得不到自己想要的成绩。高中对于我来说目标就是能进年级前1000(年级大概2200人)，然而直到高考前的最后一次考试都没有机会实现我的目标。</p>
      <p>也许是上帝都看不下去了，最终在高考满足了我的愿望。我对于大学没有做更多的选择，因为自身原因，我也别无选择。最终以556分进入西南石油大学的物联网工程专业，成为了一个我现在既讨厌又无奈的程序猿。</p>
      <p>之所以说大学确实可以是轻松的，因为每个人的大学都有很多选择的过法，从一开始选择了一条道路，就已经没有回头的选择了。</p>
      <p>至少在我身边的许多人都选择了轻松的度过大学，每天的烦恼就是在于又要早起上这门数据库原理课，又或者是忙于Java实验作业，除此之外就是在寝室中悠然的打着游戏。相信大学之前许多人都是这么看待大学的，我也不例外。</p>
      <p>还记得那是开学的某个晚自习，有许多学生会和社团来教室招新，我也是在那时认识了新媒体和翼灵物联网工作室(以下简称团队)，新媒体是负责计科院微信公众号图文的编写与推送，我当时有幸加入了其他，负责其中的图文的撰写，不过像我这种语文功底实在是笨拙的人来说，是有点为难我了。不过那学期我也因此结识了不少的朋友。</p>
      <p>在我大学四年中对我影响最大的就是翼灵，这是个什么样的组织呢？</p>
      <p>一个大学生组织的团队，里面有的都是编程的大佬，从我加入翼灵到现在，已经有不少的学长就职于腾讯、阿里、美团等BAT、TMD的互联网大厂。这是个神奇的地方，有着严格的规章制度，也正是在这里，开始了我的编程生涯。</p>
      <p>我没有选择轻松的大学生活，我的大学其实还是十分单调的。每天除了必修的课程以外，都将自己置身于团队中，学习那些曾经听都不曾听说过的专业知识，每天都是那么的疲惫，有时在团队一坐就是一天，也有时晚上11点仍在团队忙于敲代码中，那段生活就好像回到了高中一般。。。</p>
      <p><strong>剑尚未佩妥，出门已是江湖。</strong></p>
      <p>为什么我会这样折磨自己。环境带来的影响很大，在团队中学长们带来的能量一直影响着我，在这里不努力只有被淘汰。看着学长们一个个找到的高薪工作，眼里只有着羡慕。从那时起我的脑海里就是，我也一定要这样。我的大学几乎都付出在了团队当中，最终也收获了许多，但是也正因为如此，我的大学也错过了许多，羡慕那些从校园到结婚的爱情，羡慕在大学时期游遍祖国山海的人，或者说，至少到目前为止，我的大学仍然是不那么满意的吧。</p>
      <p>今年春招之后选择了去深圳某游戏公司实习，在去深圳的五个月里学会了许多职场的道理。果真是长时间的躲在父母和学校的保护下，第一次踏入社会的过程是多么的艰难和无知。</p>
      <p>作为一名Java开发实习生，在公司实习的过程中，我也因为自己的错误给导师造成了许多的麻烦。曾经因为代码中的Bug导致公司的一款游戏在凌晨运行奔溃，仍记得那天早上醒来，看着手机在4:00时的未接来电，那一刻我真的慌了，很害怕会不会因为自己的一点失误给公司带来什么损失，那天都在自责中度过，所幸的是导师并没有因此责怪过我什么，周围的朋友也对我说实习生难免会犯错误，从那以后每次的代码提交自己都会反复的审查，直到我认为没有Bug为止。</p>
      <p>也很感谢当时的导师在我实习的三个月教会我的东西，让我明白了一个公司的员工要做到对自己的事情负责，对自己的工作负责，责任心真的比什么都重要。不过最后也还是让导师失望，最终选择离开了公司，不甘愿当前的发展，想要去寻找更大的平台。在我走的那一天，导师给我说了许多职场的道理，也让我第一次的接触了这个充满人情世故的社会。</p>
      <p>高中等待大学，大学等待工作，工作等待升职，可当这些东西到来的时候，我们好像也并没有那么快乐</p>
      <p>去职场走了一遭过后，才明白在校园的生活是多么的舒适。怀念曾经坐在教室中学习的时光，怀念在宿舍中一伙人玩耍的经历，怀念在团队我们一伙人坐在楼梯上看着英雄联盟S8总决赛的日子，大学原来真的很快。</p>
      <p>时光不重来，你我依在。</p>
      <h2 id="h2-u6C42u804Cu8DEFu7A0B"><a name="求职路程" class="reference-link"></a><span class="header-link octicon octicon-link"></span>求职路程</h2><p>在说自己求职的经历之前，需要先说说互联网招聘流程以及一些名词：春招、秋招、提前批、正式批。</p>
      <p>招聘流程：简历筛选 -&gt; 笔试 -&gt; 2到5轮面试+hr面 -&gt; 发放offer</p>
      <p>春招：针对暑假实习开展的一次招聘，公司较少，面试难度小，工作时间为大三结束的暑假。<br>秋招：针对次年毕业的学生的一次大规模招聘，公司较多，面试过程多难度较大，工作时间为毕业之后。<br>提前批：通过内推渠道给内推人提交简历，有的公司内推可以免简历筛选直接进入笔试环节，有的公司是简历筛选后免笔试直接进入面试环节。<br>正式批：老老实实的投简历，然后简历筛选，再然后乖乖的做笔试。</p>
      <p>我是在大三上学期开始准备的面试复习，那时候复习的进度相比团队中的其他人已经慢了许多，加上要复习的东西真的太多了，时常都是每天最后复习到眼睛涩涩的。像要复习的那些东西又是复习完了后面忘了前面，今天复习完了昨天的又忘了，最后选择每复习一块就把这一块的东西写下来，那些面试要问的问题也是复习完了一遍又再去看第二遍的。</p>
      <p>我的简历在大三上的那一年的12月完成，当时也投递了一家成都的公司，最终被告知人家需要的是次年毕业的学生，我的第一次简历投递就这么草草结束，再后来就是在过年回家之前，在牛客网上看到了头条的内推，于是我就自信满满的将自己的简历发到对方的邮箱中，内推人告诉我如果有面试的话过年后就会马上收到，当时的我还是太天真。。。(当时还不知道头条这家公司的规模，直到我投了许多公司后才知道头条被称为宇宙条是有原因的)</p>
      <p>我正式开始海投简历是在年后第二周，我选择草草结束过年氛围选择回到学校，开始自己的海投之旅，今年被称为互联网的寒冬，许多互联网公司都在裁员，我的春招之旅也并不是一帆风顺，投了大概有15-20家公司，收到面试的大概5家左右，其余的都没有消息(这时候我是参加的提前批2-3月，正式批是3-5月)，其中大厂也面过腾讯、阿里，但是都是在要么第三轮或者第四轮时挂掉，最终在2月底我拿到了第一个offer，是一家游戏公司，也是我最后决定去的公司，我的提前批面试大概如此，令几个月后比较懊悔的是当初的我在提前批拿到几个offer过后就开始松懈，没有认真参加正式批，这也是后话了。</p>
      <p>互联网今年的春招开始的很早，结束的也早，好在没有错过提前批，并顺利的拿到一些offer，为啥说好在呢，因为我参加的提前批都不用笔试，我对我的简历还是有点信心的，但是自己的短板就在笔试上，这点我心里还是有数的(比较不是ACM大佬，算法是真的难受)</p>
      <p>我的春招大概在3月中旬就结束了，然后就是疯狂开心的玩耍，这也是我做的最错误的一件事。</p>
      <p>我的暑假实习时间选择的是6月去实习，在那几个月里沉迷于挣钱(这家工资挺高的)，却不知道危险正在靠近。在实习的那段时间每天做着许许多多的需求，这些需求压的我缓不过气来，这大多数的需求都是相对简单的，但是抵不过数量啊，最终在三个月后我选择了离开。</p>
      <p>在我辞职时已是9月，那是秋招早已经开始，并且秋招提前批已经结束….这也意味着我的秋招只有从正式批开始，辞职的那段时间每天在家里忙着各个公司的笔试，苦不堪言，最多的是连续两周几乎每天都要做一家公司的笔试题，那段时间真的恨当初为什么没有好好的刷算法题。</p>
      <p>整个九月我基本都是在笔试中度过，笔试做了很多，但是结果却不是很理想，没办法这都是自己找的，最后在九月末我开始奔波于深圳广州大学，参加其中的宣讲会，确实线下笔试还是要简单许多(手动狗头:))。最后在连续三天的深圳广州奔波中拿了腾讯微保的offer，总算是让我可以缓下一口气。</p>
      <p>我的秋招算起来很简单，笔试无数，面试三家。整个秋招我做了大概有20家公司的笔试，却只面试了三家公司，其中蘑菇街面完信心满满然后至今都还不知道为啥会被挂，后面的就是深信服和微保的offer，前者工资和职位不太满意所以最后选择了后者。</p>
      <p>这就是我2019年的春秋招过程，经历了很多，有过懊悔也有过庆幸。如果你也是一名在校准备找公司的学生，记住春招只是为秋招镀金，如果没有镀金的经历，最好还是要趁早准备秋招。春招如果没有找到大厂的实习，那就去中小厂尽早实习，然后赶在秋招提前批前完善简历，加上实习经历，然后赶紧的赶紧的赶紧的去秋招，不然，笔试真的能做到你哭。</p>
      <h2 id="h2--"><a name="愿你编码半生，归来仍是少年" class="reference-link"></a><span class="header-link octicon octicon-link"></span>愿你编码半生，归来仍是少年</h2><p>最后还是以标题来结尾吧，既然已经选择了程序猿这条路，就要走下去，这条路惊喜与挑战并存，毕竟程序猿的高收入当然还是要得高付出的。</p>
      <p>只希望我们可以初心依旧，不论前方路途是多么的孤独，仍可以义无反顾的走下去。</p>
      <p>也希望我们都可以，编码半生，归来仍是少年。</p>
    </div>
    <div class="article-footer">
      <div class="endButton">完</div>
    </div>
  </div>
</div>
</template>

<script>
//这里可以导入其他文件（比如：组件，工具js，第三方插件js，json文件，图片文件等等）
//例如：import 《组件名称》 from '《组件路径》';

export default {
//import引入的组件需要注入到对象中才能使用
components: {},
data() {
//这里存放数据
return {

};
},
//监听属性 类似于data概念
computed: {
  articleIndex() {
    return this.$route.query.id
  }
},
//监控data中的数据变化
watch: {},
//方法集合
methods: {

},
//生命周期 - 创建完成（可以访问当前this实例）
created() {

},
//生命周期 - 挂载完成（可以访问DOM元素）
mounted() {
},
beforeCreate() {}, //生命周期 - 创建之前
beforeMount() {}, //生命周期 - 挂载之前
beforeUpdate() {}, //生命周期 - 更新之前
updated() {}, //生命周期 - 更新之后
beforeDestroy() {}, //生命周期 - 销毁之前
destroyed() {}, //生命周期 - 销毁完成
activated() {}, //如果页面有keep-alive缓存功能，这个函数会触发
}
</script>
<style lang='scss' scoped>
//@import url(); 引入公共css类
.article {
  width: calc(100% - 700px);
  margin: 0 auto;
  .article-top {
    margin-top: 80px;
    text-align: center;
    h1 {
      font-size: 28px;
      font-weight: 400;
      color: #4e4e4e;
    }
    .article-info {
      margin-top: 40px;
      span {
        margin-left: 8px;
        i {
          font-style: normal;
          color: #333;
        }
      }
    }
    .article-say {
      border-left: solid 2px #992c12;
      margin-top: 30px;
      text-align: left;
      padding: 15px 7px;
      background-color: #cbee78;
      font-size: 16px;
      font-family: 楷体;
      span {
        float: right;
        margin-right: 15px;
      }
    }
  }
  .article-content {
    margin: 60px 0 30px 0;
    text-align: left;
    font-size: 14px;
    line-height: 1.6;
    padding: 20px;
    overflow: auto;
    width: 100%;
    background-color: #fff;
    p {
      margin-bottom: 20px;
    }
  }
  
  .article-footer{
    text-align: center;
    .endButton {
      box-sizing: border-box;
      display: inline-block;
      width: 48px;
      height: 48px;
      font-size: 24px;
      line-height: 48px;
      border-radius: 50%;
      background-color: #f04242;
      text-align: center;
      color: #fff;
    }
  }
  
}
</style>